---
kind: property
id: P:Autodesk.Revit.DB.BaseImportOptions.VisibleLayersOnly
source: html/63d17f7a-a3c2-7c3f-2f24-cdd553248fab.htm
---
# Autodesk.Revit.DB.BaseImportOptions.VisibleLayersOnly Property

Only import the visible layers.

## Syntax (C#)
```csharp
public bool VisibleLayersOnly { get; set; }
```

## Remarks
If this option is set to true, only visible layers are imported.
 For dgn import, this option is unsupported.